
# -*- coding: utf-8 -*-
"""
flask appの初期化を行い、flask appオブジェクトの実体を持つ
"""
from flask import Flask, request,jsonify,render_template,url_for,redirect
from datetime import timedelta

#from models.database import init_db


def create_app():
    app = Flask(__name__)
    #app.config.from_object('models.config.Config')

    #init_db(app)

    #app.config['SQLALCHEMY_DATABASE_URI'] = 'sqlite:////tmp/test.db'
    return app


class Kamoku:
    def __init__(self,id,youbi,name):
        self.id = id
        self.youbi = youbi
        self.name = name

app = create_app()

@app.route('/',methods=['GET'])
def index():
    return redirect(url_for('kamoku_all'))
    return render_template('index.html',data=data)

# 教員ページトップ
# 科目選択を行う
@app.route('/user',methods=['GET'])
def kamoku_all():
    #kyoin = request.args.get('kyoin')
    #kyoin = current_user.id
    kamoku_data = [Kamoku('T4_1','金曜日','応用数学'),Kamoku('T5','火曜日','数学演習')]
    return render_template('select.html',kamoku_data=kamoku_data)



# 科目の出席データ ベンチ用ページ
@app.route('/kamoku/<string:kamoku>',methods=['GET'])
def syusseki_all(kamoku):
    kyoin = 'P011'
    # 0列目学籍番号，1列目学生氏名，2~17列目各回の出席データ
    kamoku_data = [Kamoku('T4_1','金曜日','応用数学'),Kamoku('T5','火曜日','数学演習')]
    table_header = ['学籍番号','氏名','第1回','第2回','第3回','第4回','第5回','第6回',\
            '第7回','第8回','第9回','第10回','第11回','第12回','第13回','第14回','第15回']
    risyu_list = [['S001', '相道森'], ['S002', '揚村巴絵'], ['S003', '浅井礼子'], ['S004', '荒松晴一'], ['S005', '有福政昭'], ['S006', '飯坂新司'], ['S007', '池澄晃樹'], ['S008', '石長佐久子'], ['S009', '泉川弘仁'], ['S010', '礒田睦史'], ['S011', '市之瀬龍治'], ['S012', '井手窪克茂'], ['S013', '井内早絵子'], ['S014', '入澤結香'], ['S015', '印公一'], ['S016', '浦松拓治'], ['S017', '恵島康道'], ['S018', '越前広'], ['S019', '江積幸廣'], ['S020', '太内信章'], ['S021', '太田島映実'], ['S022', '大舘俊幸'], ['S023', '大野貴暁'], ['S024', '大波多英三'], ['S025', '岡松慎一郎'], ['S026', '小笠公平'], ['S027', '小桐純孝'], ['S028', '奥名浩佑'], ['S029', '折原はな'], ['S030', '風洋司'], ['S031', '株竹智信'], ['S032', '茅根信道'], ['S033', '木口屋一輝'], ['S034', '城崎成寿'], ['S035', '貴下紗侑里'], ['S036', '木野大右'], ['S037', '清冨芳博'], ['S038', '木和田英記'], ['S039', '久木原光貴'], ['S040', '串間洋治'], ['S041', '久保西敏憲'], ['S042', '古岩井忠利'], ['S043', '古橋哲幸'], ['S044', '小橋川睦夫'], ['S045', '古明地宏人'], ['S046', '作花譲'], ['S047', '佐中将幸'], ['S048', '澤元詠一'], ['S049', '下川香'], ['S050', '下河内公成'], ['S051', '白鳥一功'], ['S052', '末満泰治'], ['S053', '隅田庸介'], ['S054', '鷹取知也'], ['S055', '滝田俊明'], ['S056', '田盛毅彦'], ['S057', '田屋洋志'], ['S058', '太矢浩将'], ['S059', '檀野康昭'], ['S060', '鄭健一郎'], ['S061', '東矢千裕'], ['S062', '東山勇人'], ['S063', '得永希予'], ['S064', '徳益榮'], ['S065', '戸津崎礼央奈'], ['S066', '友藤竜治'], ['S067', '豊長夢香'], ['S068', '堂脇一志'], ['S069', '中妻潔志'], ['S070', '中松光一'], ['S071', '西垣内利秀'], ['S072', '西関真寿'], ['S073', '登祐平'], ['S074', '野焼城司'], ['S075', '萩間敦大'], ['S076', '波佐間敬次'], ['S077', '蓮池夕加里'], ['S078', '初山孝徳'], ['S079', '波頭直司'], ['S080', '花本圭祐'], ['S081', '菱泰章'], ['S082', '日髙貴幸'], ['S083', '樋爪顕治'], ['S084', '平野仰'], ['S085', '広文哉'], ['S086', '深野木茂則'], ['S087', '村濱準二'], ['S088', '矢形具美'], ['S089', '八下田駿佑'], ['S090', '八武崎榛菜'], ['S091', '山畑照樹'], ['S092', '行田博彦'], ['S093', '柞木道典'], ['S094', '弓座義政'], ['S095', '吉中龍之介'], ['S096', '吉馴典和'], ['S097', '吉広清悟'], ['S098', '吉光幸太'], ['S099', '与那豊茂'], ['S100', '渡利雄祐']];
    tmplist = [['城崎成寿', '出席', 3], ['大波多英三', '出席', 1], ['大波多英三', '出席', 3], ['大舘俊幸', '出席', 1], ['大舘俊幸', '出席', 3], ['大野貴暁', '出席', 1], ['大野貴暁', '出席', 3], ['太田島映実', '出席', 1], ['太田島映実', '出席', 3], ['奥名浩佑', '出席', 3], ['小桐純孝', '出席', 3], ['小笠公平', '出席', 3], ['岡松慎一郎', '出席', 1], ['岡松慎一郎', '出席', 3], ['折原はな', '出席', 3], ['揚村巴絵', '出席', 1], ['揚村巴絵', '出席', 3], ['有福政昭', '出席', 1], ['有福政昭', '出席', 3], ['木口屋一輝', '出席', 3], ['木野大右', '出席', 3], ['株竹智信', '出席', 3], ['池澄晃樹', '出席', 1], ['池澄晃樹', '出席', 3], ['泉川弘仁', '出席', 1], ['泉川弘仁', '出席', 3], ['浅井礼子', '出席', 1], ['浅井礼子', '出席', 3], ['清冨芳博', '出席', 3], ['相道森', '出席', 1], ['相道森', '出席', 3], ['石長佐久子', '出席', 1], ['石長佐久子', '出席', 3], ['礒田睦史', '出席', 1], ['礒田睦史', '出席', 3], ['茅根信道', '出席', 3], ['荒松晴一', '出席', 1], ['荒松晴一', '出席', 3], ['貴下紗侑里', '出席', 3], ['飯坂新司', '出席', 1], ['飯坂新司', '出席', 3]];

    return render_template('syukketu.html',kyoin=kyoin,table_header=table_header,syusseki_data=sorted(tmplist,key=lambda x: x[0]),risyu_list=risyu_list,kamoku_data=kamoku_data)


import sys
if __name__=='__main__':
    app.run()

